#设置一些常用别名
alias ll='ls -alF'
alias la='ls -A'
alias l='ls -CF'
alias ..='cd ..'
#设置光标
echo -ne "\e[4 q" 
#设置提示符
#主提示符
PS1="\[\033[34m\]\D{%Y-%m-%d %H:%M}\[\033[0m\]\n \[\033[33m\]┌\[\033[0m\][\[\033[32m\]\w\[\033[0m\]\[\033[93m\]@\[\033[0m\]\[\033[32m\]\h\[\033[0m\]]-[\033[32m\]\u\[\033[0m\]]-[\033[32m\]\$?\[\033[0m\]]\n \[\033[33m\]└\[\033[0m\]\$(if [ \$(id -u) -eq 0 ]; then echo '\[\033[31m\]#\[\033[0m\]'; else echo '\[\033[32m\]\$\[\033[0m\]'; fi)> \[\033[0m\]"
#辅助提示符
PS2="\033[33m-> \033[0m"
#调试
PS4='\033[34m+\033[0m Line ${LINENO}: '

#给孩子个Star罢(可怜)